# Привести сказку про Красную шапочку (файлы в директории lesson_001/red_hat) к нормальному виду за 3 коммита
# Обратите внимание что в один коммит попадает несколько файлов.

# TODO - Сначала вернем Красную шапочку (бывш. Черную курточку) во все пять файлов из lesson_001/red_hat,

# TODO -                удалим первые два комментария TODO и сделаем коммит

# TODO - Потом Волка (бывш. Гоблин) (во всех файлах! удалить комментарий TODO! коммит!)
# TODO - И наконец - веревочку (бывш. пружинку) (удалить TODO! коммит!)
# TODO - комментарии с TODO нужно удалять вместе с выполнением каждого пункта задания
# TODO - не забывайте пушить на сервер Ваши коммиты после выполнения задания!


# WARNING для знающих git: БЕЗ веток/реквестов/етс. Да, все коммият в мастер, да на производстве так не делают.
# Это задание для начинающих, мы изучаем git с минимальным порогом входа - все методики будут потом.
# Знающие, не выпендривайтесь, а покажите что вы знаете основы. Если не хватает драйва, делайте все в консоли ;)


# Идет она лесом, а навстречу ей - серый Гоблин.
# - Куда ты идешь, Чёрная Курточка? - спрашивает Гоблин.
# - Иду к бабушке и несу ей пирожок и горшочек масла.
# - А далеко живет твоя бабушка?
# - Далеко, - отвечает Чёрная Курточка. - Вон в той деревне, за мельницей, в первом домике с края.
# - Ладно, - говорит Гоблин, - я тоже хочу проведать твою бабушку. Я по этой дороге пойду,
# а ты ступай по той. Посмотрим, кто из нас раньше придет.
# Сказал это Гоблин и побежал, что было духу, по самой короткой дорожке.